In [29]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
current_inventory = pd.read_excel('Inventory Dataset  cz5.xlsx')
inventory_received = pd.read_excel('New Inventory cz5.xlsx')

In [30]:
current_inventory.head()

   Item Number       Date  Inventory
0  064-01-1347 2023-06-17       3561
1  064-01-1361 2023-06-17       4035
2  064-01-1375 2023-06-17       2684
3  064-01-1385 2023-06-17       5136
4  064-01-1399 2023-06-17       6399

In [31]:
inventory_received.head()

   Item Number Inventory Receive  Total Item Qty
0  064-13-0002        2023-07-07             700
1  064-13-0338        2023-07-07            1700
2  064-13-0340        2023-07-07            1000
3  064-13-0353        2023-07-07            1900
4  064-13-0416        2023-07-07            1000

In [32]:
current_inventory.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
351    False
352    False
353    False
354    False
355    False
Length: 356, dtype: bool

In [33]:
inventory_received.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1034    False
1035    False
1036    False
1037    False
1038    False
Length: 1039, dtype: bool

In [34]:
current_inventory.dropna()

     Item Number       Date  Inventory
0    064-01-1347 2023-06-17       3561
1    064-01-1361 2023-06-17       4035
2    064-01-1375 2023-06-17       2684
3    064-01-1385 2023-06-17       5136
4    064-01-1399 2023-06-17       6399
..           ...        ...        ...
351  064-18-9909 2023-06-17         12
352  064-18-9962 2023-06-17         19
353  064-18-0790 2023-06-17          5
354  064-18-3316 2023-06-17       7354
355  064-18-9667 2023-06-17       7029

[356 rows x 3 columns]

In [35]:
inventory_received.dropna()

      Item Number Inventory Receive  Total Item Qty
0     064-13-0002        2023-07-07             700
1     064-13-0338        2023-07-07            1700
2     064-13-0340        2023-07-07            1000
3     064-13-0353        2023-07-07            1900
4     064-13-0416        2023-07-07            1000
...           ...               ...             ...
1034  064-09-3787        2023-07-07            2088
1035  064-09-5287        2023-07-07            1388
1036  064-09-7924        2023-07-07            1632
1037  064-09-9076        2023-07-07            1708
1038  064-09-9115        2023-07-07            1920

[1039 rows x 3 columns]

In [36]:
current_inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 356 entries, 0 to 355
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Item Number  356 non-null    object
 1   Date         356 non-null    datetime64[ns]
 2   Inventory    356 non-null    int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.5+ KB

In [37]:
inventory_received.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1039 entries, 0 to 1038
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Item Number        1039 non-null   object
 1   Inventory Receive  1039 non-null   datetime64[ns]
 2   Total Item Qty     1039 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 24.5+ KB

In [38]:
current_inventory.isna().sum()

Item Number    0
Date           0
Inventory      0
dtype: int64

In [39]:
inventory_received.isna().sum()

Item Number          0
Inventory Receive    0
Total Item Qty       0
dtype: int64

In [40]:
current_inventory.duplicated().sum()

0

In [41]:
inventory_received.duplicated().sum()

0

In [42]:
# Combine both datasets
combined_inventory = pd.concat([current_inventory, inventory_received])

In [43]:
combined_inventory

      Item Number       Date  Inventory Inventory Receive  Total Item Qty
0     064-01-1347 2023-06-17     3561.0               NaT             NaN
1     064-01-1361 2023-06-17     4035.0               NaT             NaN
2     064-01-1375 2023-06-17     2684.0               NaT             NaN
3     064-01-1385 2023-06-17     5136.0               NaT             NaN
4     064-01-1399 2023-06-17     6399.0               NaT             NaN
...           ...        ...        ...               ...             ...
1034  064-09-3787        NaT        NaN        2023-07-07          2088.0
1035  064-09-5287        NaT        NaN        2023-07-07          1388.0
1036  064-09-7924        NaT        NaN        2023-07-07          1632.0
1037  064-09-9076        NaT        NaN        2023-07-07          1708.0
1038  064-09-9115        NaT        NaN        2023-07-07          1920.0

[1395 rows x 5 columns]

In [44]:
start_date = '2023-06-17' 
end_date = '2023-08-26'

In [45]:
future_dates = pd.date_range(start_date, end_date, freq='W-SAT')

In [46]:
grouped_inventory = (
    current_inventory.groupby(['Item Number', pd.Grouper(key='Date', freq='W-SAT')])
    .sum(min_count=1))

In [47]:
grouped_inventory = grouped_inventory.reset_index()

In [48]:
future_inventory = (
    pd.MultiIndex.from_product([current_inventory['Item Number'].unique(), future_dates], names=['Item Number', 'Date'])
    .to_frame(index=False)
    .merge(grouped_inventory, how='left')
)

In [49]:
future_inventory.info

<bound method DataFrame.info of       Item Number       Date  Inventory
0     064-01-1347 2023-06-17     3561.0
1     064-01-1347 2023-06-24        NaN
2     064-01-1347 2023-07-01        NaN
3     064-01-1347 2023-07-08        NaN
4     064-01-1347 2023-07-15        NaN
...           ...        ...        ...
3911  064-18-9667 2023-07-29        NaN
3912  064-18-9667 2023-08-05        NaN
3913  064-18-9667 2023-08-12        NaN
3914  064-18-9667 2023-08-19        NaN
3915  064-18-9667 2023-08-26        NaN

[3916 rows x 3 columns]>

In [50]:
specific_item_inventory1 = future_inventory[future_inventory['Item Number'] == '064-09-3787']

In [51]:
specific_item_inventory1

      Item Number       Date  Inventory
1122  064-09-3787 2023-06-17    27104.0
1123  064-09-3787 2023-06-24        NaN
1124  064-09-3787 2023-07-01        NaN
1125  064-09-3787 2023-07-08        NaN
1126  064-09-3787 2023-07-15        NaN
1127  064-09-3787 2023-07-22        NaN
1128  064-09-3787 2023-07-29        NaN
1129  064-09-3787 2023-08-05        NaN
1130  064-09-3787 2023-08-12        NaN
1131  064-09-3787 2023-08-19        NaN
1132  064-09-3787 2023-08-26        NaN

In [52]:
specific_item_inventory2 = future_inventory[future_inventory['Item Number'] == '064-09-9076']

In [53]:
specific_item_inventory2

      Item Number       Date  Inventory
1419  064-09-9076 2023-06-17    21342.0
1420  064-09-9076 2023-06-24        NaN
1421  064-09-9076 2023-07-01        NaN
1422  064-09-9076 2023-07-08        NaN
1423  064-09-9076 2023-07-15        NaN
1424  064-09-9076 2023-07-22        NaN
1425  064-09-9076 2023-07-29        NaN
1426  064-09-9076 2023-08-05        NaN
1427  064-09-9076 2023-08-12        NaN
1428  064-09-9076 2023-08-19        NaN
1429  064-09-9076 2023-08-26        NaN

In [54]:
specific_item_inventory3 = future_inventory[future_inventory['Item Number'] == '064-09-9115']

In [55]:
specific_item_inventory3

      Item Number       Date  Inventory
1430  064-09-9115 2023-06-17    21526.0
1431  064-09-9115 2023-06-24        NaN
1432  064-09-9115 2023-07-01        NaN
1433  064-09-9115 2023-07-08        NaN
1434  064-09-9115 2023-07-15        NaN
1435  064-09-9115 2023-07-22        NaN
1436  064-09-9115 2023-07-29        NaN
1437  064-09-9115 2023-08-05        NaN
1438  064-09-9115 2023-08-12        NaN
1439  064-09-9115 2023-08-19        NaN
1440  064-09-9115 2023-08-26        NaN

In [75]:
df1 = pd.DataFrame(current_inventory)
df2 = pd.DataFrame(inventory_received)
df1['Date'] = pd.to_datetime(df['Date'])
df2['Date'] = pd.to_datetime(df['Date'])
df1['Month'] = df['Date'].dt.month
df2['Month'] = df['Date'].dt.month
monthly_inventory1 = df1.groupby('Month')['Item Number'].diff().fillna(df['Item Number']).reset_index(name='Monthly_Inventory')
plt.figure(figsize=(10, 6))
sns.barplot(x='index', y='Monthly_Inventory', data=monthly_inventory, palette='viridis')
plt.xlabel('Month')
plt.ylabel('Monthly Inventory Change')
plt.title('Monthly Inventory Change Levels')
plt.tight_layout()

TypeError: unsupported operand type(s) for -: 'str' and 'str'